trunk/UDSPC/app/controllers/applications_controller.rb

  def index
    @applications = Application.all
---
SELECT * FROM "applications"

  def show
    @application = Application.find(params[:id])
---
SELECT * FROM "applications" WHERE ("applications"."id" = 1)

  def edit
    @application = Application.find(params[:id])
---
SELECT * FROM "applications" WHERE ("applications"."id" = 1)

  def create
    @application = Application.new(params[:application])

    respond_to do |format|
      if @application.save
---
INSERT INTO "applications" ("SendingDate", "updated_at", "applicant_id", "job_oppertunity_id", "created_at") VALUES('2009-05-25 21:44:00', '2009-05-25 21:45:49', NULL, 1, '2009-05-25 21:45:49')

  def destroy
    @application = Application.find(params[:id])
    @application.destroy
---
SELECT * FROM "applications" WHERE ("applications"."id" = 1)
DELETE FROM "applications" WHERE "id" = 1

  def myApplications
    @applications = Application.find(:all, :conditions => ["applicant_id = ?", params[:id]]);
---
SELECT * FROM "applications" WHERE (applicant_id = '1')