trunk/UDSPC/app/controllers/categories_controller.rb

  def create
    @category = Category.new(params[:category])

    respond_to do |format|
      if @category.save
---
INSERT INTO "categories" ("Name", "updated_at", "Code", "created_at") VALUES('VLSI Chips', '2009-05-16 00:44:25', '3', '2009-05-16 00:44:25')

  def update
    @category = Category.find(params[:id])

    respond_to do |format|
      if @category.update_attributes(params[:category])
---
SELECT * FROM "categories" WHERE ("categories"."id" = 1)
UPDATE "categories" SET "updated_at" = '2009-05-16 00:43:40', "Name" = 'Processors' WHERE "id" = 1