trunk/UDSPC/app/controllers/home_controller.rb

 def sign
   @users = User.find(:all, :conditions => ["LoginName = ? AND Password = ?", params[:loginName], params[:password]])
   if @users.length > 0
     session[:loggedUser] = @users[0]
   else
     @users = Customer.find(:all, :conditions => ["LoginName = ? AND Password = ?", params[:loginName], params[:password]])
     if @users.length > 0
        session[:loggedCustomer] = @users[0]
     else
        @users = Applicant.find(:all, :conditions => ["LoginName = ? AND Password = ?", params[:loginName], params[:password]])
---
SELECT * FROM "users" WHERE (LoginName = 'msaad' AND Password = 'prince')
SELECT * FROM "customers" WHERE (LoginName = 'Ali' AND Password = 'prince')
SELECT * FROM "applicants" WHERE (LoginName = 'ali' AND Password = 'prince')

 def search
   if params['id'] != nil
     @list = Product.find(params['id']).product_models
---
SELECT * FROM "product_models" WHERE ("product_models".product_id = 1)
SELECT * FROM "products" WHERE ("products".category_id = 1)