trunk/UDSPC/app/controllers/keywords_controller.rb

  def index
    @keywords = Keyword.all
---
SELECT * FROM "keywords"

  def show
    @keyword = Keyword.find(params[:id])
---
SELECT * FROM "keywords" WHERE ("keywords"."id" = 1)

  def create
    @keyword = Keyword.new(params[:keyword])

    respond_to do |format|
      if @keyword.save
---
INSERT INTO "keywords" ("updated_at", "product_model_id", "product_id", "Word", "created_at") VALUES('2009-05-15 18:21:43', 6, NULL, 'Processor', '2009-05-15 18:21:43')