trunk/UDSPC/app/controllers/orders_controller.rb

  def index
    @orders = Order.all
---
SELECT * FROM "orders"

  def show
    @order = Order.find(params[:id])
---
SELECT * FROM "orders" WHERE ("orders"."id" = 0)

  def myOrders
    @orders = Order.find(:all, :conditions => ["customer_id = ?", params[:id]]);
---
SELECT * FROM "orders" WHERE (customer_id = '1')