trunk/UDSPC/app/controllers/product_models_controller.rb

  def index
    @product_models = ProductModel.all
---
SELECT * FROM "product_models"
SELECT * FROM "products" WHERE ("products".category_id = 1)

  def show
    @product_model = ProductModel.find(params[:id])
---
SELECT * FROM "product_models" WHERE ("product_models"."id" = 1)
SELECT * FROM "products" WHERE ("products".category_id = 1)

  def edit
    @product_model = ProductModel.find(params[:id])
---
SELECT * FROM "product_models" WHERE ("product_models"."id" = 1)
SELECT * FROM "products" WHERE ("products".category_id = 1)

  def create
    @product_model = ProductModel.new(params[:product_model])

    respond_to do |format|
      if @product_model.save
---
INSERT INTO "product_models" ("Name", "Rate", "Features", "Size", "updated_at", "Serial", "IsSpecialOffer", "ImageURL", "QuantityOnHand", "product_id", "Discount", "Price", "SalesPackageContent", "RelatedDocumentURL", "Description", "ReorderPoint", "created_at") VALUES('TMS320DM644x DSPs SOCs ', NULL, '', '', '2009-05-15 17:40:13', 644, 't', '', NULL, 1, NULL, NULL, '', '', '', NULL, '2009-05-15 17:40:13')

  def update
    @product_model = ProductModel.find(params[:id])

    respond_to do |format|
      if @product_model.update_attributes(params[:product_model])
---
SELECT * FROM "product_models" WHERE ("product_models"."id" = 1)
UPDATE "product_models" SET "Description" = 'TMS320C55x™ DSPs - including the TMS320C5506, TMS320C5503, TMS320C5507 and TMS320C5509A DSPs, are the industry’s most power-efficient DSPs and feature ultra-low stand-by power. Advanced power management techniques automatically power down inactive peripherals, memory and core functional units increasing battery life. Also included are the OMAP™ devices with low-power, real-time signal processing coupled with the command and control functionality of an ARM.', "product_id" = 2, "updated_at" = '2009-05-16 00:52:36' WHERE "id" = 3

  def destroy
    @product_model = ProductModel.find(params[:id])
    @product_model.destroy
---
SELECT * FROM "product_models" WHERE ("product_models"."id" = 2)
DELETE FROM "product_models" WHERE "id" = 2