trunk/UDSPC/app/controllers/shopping_carts_controller.rb

  def create
    @cart = session[:cart]
    unless @cart
      @cart = []
    end
    item = OrderItem.new
    p = ProductModel.find(params[:id]);
---
SELECT * FROM "product_models" WHERE ("product_models"."id" = 1)