UDSPC/app/controllers/applicants_controller.rb

  def index
    @applicants = Applicant.all
---
SELECT * FROM "applicants"

  def show
    @applicant = Applicant.find(params[:id])
---
SELECT * FROM "applicants" WHERE ("applicants"."id" = 1)

  def edit
    @applicant = Applicant.find(params[:id])
---
SELECT * FROM "applicants" WHERE ("applicants"."id" = 1)

  def create
    @applicant = Applicant.new(params[:applicant])

    respond_to do |format|
      if @applicant.save
---
INSERT INTO "applicants" ("Name", "DesieredPosition", "Notes", "Gender", "updated_at", "CreditNumber", "Experience", "DateOfBirth", "Password", "SecuirtyNumber", "TelephoneNumber", "EMail", "CurrentPosition", "BillingAddress", "Education", "Address", "LoginName", "ShippingAddress", "created_at") VALUES('Hamdy', '', '', NULL, '2009-05-22 16:19:49', '', '', '2004-05-22', 'prince', '', '01012323232', 'hamdi@yahoo.com', '', '', '', '43 Rushdi, Alexandria', 'hamdi', '', '2009-05-22 16:19:49')