UDSPC/app/controllers/customers_controller.rb

  def index
    @customers = Customer.all
---
SELECT * FROM "customers"

  def show
    @customer = Customer.find(params[:id])
---
SELECT * FROM "customers" WHERE ("customers"."id" = 1)

  def edit
    @customer = Customer.find(params[:id])
---
SELECT * FROM "customers" WHERE ("customers"."id" = 1)

  def create
    @customer = Customer.new(params[:customer])

    respond_to do |format|
      if @customer.save
---
INSERT INTO "customers" ("Name", "ContactPersonName", "updated_at", "CreditNumber", "BussinessName", "Password", "SecuirtyNumber", "TelephoneNumber", "EMail", "BillingAddress", "Fax", "Type", "Address", "LoginName", "ShippingAddress", "TaxsNumber", "created_at") VALUES('Ali', '', '2009-05-22 15:55:10', '', '', 'prince', '', '0120341665', 'ali@yahoo.com', '11 Smoha, Alexandria', '', NULL, '11 Smoha, Alexandria', 'Ali', '11 Smoha, Alexandria', '', '2009-05-22 15:55:10')

  def destroy
    @customer = Customer.find(params[:id])
    @customer.destroy
---
SELECT * FROM "customers" WHERE ("customers"."id" = 3)
DELETE FROM "customers" WHERE "id" = 3