UDSPC/app/controllers/job_oppertunities_controller.rb

SELECT * FROM "job_oppertunities"
---
  def index
    @job_oppertunities = JobOppertunity.all

SELECT * FROM "job_oppertunities" WHERE ("job_oppertunities"."id" = 1)
---
  def show
    @job_oppertunity = JobOppertunity.find(params[:id])

INSERT INTO "job_oppertunities" ("Department", "updated_at", "Salary", "JobTitle", "Description", "Prequisites", "created_at") VALUES('Customer Support ', '2009-05-22 14:17:11', 800, 'Support Technician', '', '', '2009-05-22 14:17:11')
---
  def create
    @job_oppertunity = JobOppertunity.new(params[:job_oppertunity])

    respond_to do |format|
      if @job_oppertunity.save