UDSPC/app/controllers/permissions_controller.rb

SELECT * FROM "permissions" WHERE (user_id = 1)
---
  def index
    @permissions = Permission.all

SELECT * FROM "permissions" WHERE ("permissions"."id" = 1)
---
  def show
    @permission = Permission.find(params[:id])

SELECT * FROM "permissions" WHERE ("permissions"."id" = 1)
---
  def edit
    @permission = Permission.find(params[:id])

INSERT INTO "permissions" ("updated_at", "PermissionType", "url", "Module", "Page", "user_id", "created_at") VALUES('2009-05-27 13:23:40', 0, '/job_oppertunities', 'HR', 'Jobs', 2, '2009-05-27 13:23:40')
---
  def create
    @permission = Permission.new(params[:permission])

    respond_to do |format|
      if @permission.save

SELECT * FROM "permissions" WHERE ("permissions"."id" = 1)
UPDATE "permissions" SET "url" = '/job_oppertunities', "updated_at" = '2009-05-22 19:34:11', "Page" = 'Jobs' WHERE "id" = 1
---
  def update
    @permission = Permission.find(params[:id])

    respond_to do |format|
      if @permission.update_attributes(params[:permission])