UDSPC/app/controllers/products_controller.rb

  def index
    @products = Product.all
---
SELECT * FROM "products" WHERE ("products".category_id = 1)

  def show
    @product = Product.find(params[:id])
---
SELECT * FROM "products" WHERE ("products".category_id = 1)

  def edit
    @product = Product.find(params[:id])
---
SELECT * FROM "products" WHERE ("products".category_id = 1)

  def create
    @product = Product.new(params[:product])

    respond_to do |format|
      if @product.save
---
INSERT INTO "products" ("Name", "Code", "ImageURL", "updated

  def update
    @product = Product.find(params[:id])

    respond_to do |format|
      if @product.update_attributes(params[:product])
---
SELECT * FROM "products" WHERE ("products"."id" = 1)
UPDATE "products" SET "Description" = 'dominate the floating-point Digital Signal Processing market, delivering exceptional core and memory performance complemented by outstanding I/O throughput. Starting at 319 MFLOPS', "KeyWords" = '', "ImageURL" = '', "Name" = 'Shark Processors' WHERE "id" = 1

  def destroy
    @product = Product.find(params[:id])
    @product.destroy
---
SELECT * FROM "products" WHERE ("products"."id" = 5)
DELETE FROM "products" WHERE "id" = 5