UDSPC/app/controllers/shopping_carts_controller.rb

SELECT * FROM "product_models" WHERE ("product_models"."id" = 1)
---
  def create
    @cart = session[:cart]
    unless @cart
      @cart = []
    end
    item = OrderItem.new
    p = ProductModel.find(params[:id]);

INSERT INTO "orders" ("ConfimationNumber", "updated_at", "OrderStatus", "TotalPrice", "ShippingCosts", "customer_id", "PaymentMethod", "OrderDate", "PurchaseNumber", "created_at") VALUES(NULL, '2009-05-27 03:00:18', 0, 2430.0, 20.0, 2, 0, '-4713-12-31 22:00:00', 780076, '2009-05-27 03:00:18')
---
  def confirm
    tp = 0
    for product in session[:cart]
      tp =tp + product.ItemPrice*product.Quantity*(1+product.Taxs)
    end
    order = Order.new
    order.OrderDate = Time.now
    order.OrderStatus = 0
    order.TotalPrice = tp
    order.PaymentMethod = 0
    order.PurchaseNumber = rand(1000000)
    order.ShippingCosts = 10 * session[:cart].length
    order.customer_id = session[:loggedCustomer].id
    order.save